---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.Pipe.IsPlaceholder
zh: 管道、水管、管线
source: html/3f8c2daf-6f77-1288-fa37-9eebd54cedb6.htm
---
# Autodesk.Revit.DB.Plumbing.Pipe.IsPlaceholder Property

**中文**: 管道、水管、管线

Identifies if the pipe is a placeholder or not.

## Syntax (C#)
```csharp
public bool IsPlaceholder { get; }
```